; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-67)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 - object)
 (:init 
    (arm-empty)
    (clear b16)
    (on b16 b20)
    (on b20 b2)
    (on b2 b13)
    (on b13 b12)
    (on b12 b3)
    (on-table b3)
    (clear b17)
    (on b17 b15)
    (on b15 b5)
    (on b5 b19)
    (on b19 b8)
    (on b8 b11)
    (on b11 b1)
    (on b1 b14)
    (on b14 b7)
    (on b7 b10)
    (on b10 b9)
    (on b9 b4)
    (on b4 b6)
    (on b6 b18)
    (on-table b18))
 (:goal (and 
(clear b19) (on b19 b8)
))
)

; plan
1. (unstack b17 b15)
   deleted: (on b17 b15) (clear b17) (arm-empty)
   added: (holding b17) (clear b15)
   goals met: 1 of 2
2. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 1 of 2
3. (unstack b15 b5)
   deleted: (on b15 b5) (clear b15) (arm-empty)
   added: (holding b15) (clear b5)
   goals met: 1 of 2
4. (putdown b15)
   deleted: (holding b15)
   added: (clear b15) (arm-empty) (on-table b15)
   goals met: 1 of 2
5. (unstack b5 b19)
   deleted: (on b5 b19) (clear b5) (arm-empty)
   added: (holding b5) (clear b19)
   goals met: 2 of 2
